### Libraries

In [5]:
import sqlite3
import pandas as pd
import datetime as dt

### Connect

In [6]:
# Create or connect to sql database
# Provide your specific location for the .db file

# Crear o conectar a una base de datos sql
# Seleccionar su ubicación específica para el archivo .db

connection = sqlite3.connect('C:/Users/usuario/%Python/sql-practice/db_a.db')

In [3]:
# Cursor is a database object that allows to perform operations in a dataset

# Cursor es un objeto que permite ejecutar operaciones en un dataset
cursor = connection.cursor()

In [4]:
# This method (commit) is used to confirm the changes made to the database

# El método commit se usa para confirmar los cambios hechos en la base de datos
connection.commit()

In [ ]:
# This method (close) ends the connection. It should be executed only at the end of the coding.

# El método Close termina la conexión. Solo debe ser ejecutado al finalizar el código.
connection.close()

### db_a

db_a is the name for the database, which will be formed by five tables: courses, instructors, schools, submissions, users.

db_a es el nombre que daremos a la base de datos, que será formada por cinco tablas: courses, instructors, schools, submissions, users.

### Schools

In [86]:
# Load data file

# Cargar el archivo de datos
d1 =  pd.read_csv('C:/Users/usuario/%Python/sql-practice/schools.csv')

In [87]:
d1.head()

,id,school_name,online_school,category,date_created,lottery,country,sync_date
0,759.0,Universtity of725,0,10,2019-09-07 00:00:00,11,US,2019-09-08 00:00:00
1,483.0,Universtity of1398,1,8,2019-07-19 00:00:00,19,US,2019-07-20 00:00:00
2,433.0,Universtity of693,1,10,2019-07-01 00:00:00,5,US,2019-07-02 00:00:00
3,728.0,Universtity of1104,1,9,2019-04-02 00:00:00,3,US,2019-04-03 00:00:00
4,451.0,Universtity of498,1,4,2019-02-17 00:00:00,10,US,2019-02-18 00:00:00

In [21]:
d2 = pd.read_csv('C:/Users/usuario/%Python/sql-practice/schools.csv',dtype={'id': 'str'})

In [22]:
# Eplore dtypes

# Tipo de datos

d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 846 entries, 0 to 845
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             845 non-null    float64
 1   school_name    846 non-null    object
 2   online_school  846 non-null    int64
 3   category       846 non-null    int64
 4   date_created   846 non-null    object
 5   lottery        846 non-null    int64
 6   country        846 non-null    object
 7   sync_date      846 non-null    object
dtypes: float64(1), int64(3), object(4)
memory usage: 53.0+ KB

In [23]:
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 846 entries, 0 to 845
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             845 non-null    object
 1   school_name    846 non-null    object
 2   online_school  846 non-null    int64
 3   category       846 non-null    int64
 4   date_created   846 non-null    object
 5   lottery        846 non-null    int64
 6   country        846 non-null    object
 7   sync_date      846 non-null    object
dtypes: int64(3), object(5)
memory usage: 53.0+ KB

In [24]:
d2.head()

,id,school_name,online_school,category,date_created,lottery,country,sync_date
0,759,Universtity of725,0,10,2019-09-07 00:00:00,11,US,2019-09-08 00:00:00
1,483,Universtity of1398,1,8,2019-07-19 00:00:00,19,US,2019-07-20 00:00:00
2,433,Universtity of693,1,10,2019-07-01 00:00:00,5,US,2019-07-02 00:00:00
3,728,Universtity of1104,1,9,2019-04-02 00:00:00,3,US,2019-04-03 00:00:00
4,451,Universtity of498,1,4,2019-02-17 00:00:00,10,US,2019-02-18 00:00:00

In [25]:
# convert the 'Date' column to datetime format

# Convertir la columna "Date" a formato datetime
d2['date_created_2']= pd.to_datetime(d2['date_created'])
d2['sync_date_2']= pd.to_datetime(d2['sync_date'])

In [26]:
d2.head()

,id,school_name,online_school,category,date_created,lottery,country,sync_date,date_created_2,sync_date_2
0,759,Universtity of725,0,10,2019-09-07 00:00:00,11,US,2019-09-08 00:00:00,2019-09-07,2019-09-08
1,483,Universtity of1398,1,8,2019-07-19 00:00:00,19,US,2019-07-20 00:00:00,2019-07-19,2019-07-20
2,433,Universtity of693,1,10,2019-07-01 00:00:00,5,US,2019-07-02 00:00:00,2019-07-01,2019-07-02
3,728,Universtity of1104,1,9,2019-04-02 00:00:00,3,US,2019-04-03 00:00:00,2019-04-02,2019-04-03
4,451,Universtity of498,1,4,2019-02-17 00:00:00,10,US,2019-02-18 00:00:00,2019-02-17,2019-02-18

In [27]:
# Check the new format of 'Date' column

# Revisar el nuevo formato de la columna "Date"
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 846 entries, 0 to 845
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              845 non-null    object
 1   school_name     846 non-null    object
 2   online_school   846 non-null    int64
 3   category        846 non-null    int64
 4   date_created    846 non-null    object
 5   lottery         846 non-null    int64
 6   country         846 non-null    object
 7   sync_date       846 non-null    object
 8   date_created_2  846 non-null    datetime64[ns]
 9   sync_date_2     846 non-null    datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(5)
memory usage: 66.2+ KB

In [ ]:
d2['online_school'].value_counts()

1    433
0    413
Name: online_school, dtype: int64

In [29]:
d2.online_school = d2.online_school.astype(str)

In [33]:
# Load datafile to the database (with replace)

# Cargar el archivo a la base de datos (con replace)

d1.to_sql('schools',connection,if_exists='replace')

846

### Instructors

In [34]:
# Load data file

# Cargar el archivo de datos
d_instructors =  pd.read_csv('C:/Users/usuario/%Python/sql-practice/instructors.csv')

In [35]:
d_instructors.head()

,id,school_id,course_id,email,date_created,admin,category,external_id,sync_date
0,6410,757.0,41,64105164@email.com,2019-07-20 00:00:00,0,3,student_8472,2019-07-21 00:00:00
1,3515,549.0,10,35153981@email.com,2019-10-25 00:00:00,0,8,student_6471,2019-10-26 00:00:00
2,2866,219.0,55,28662212@email.com,2020-04-19 00:00:00,0,1,student_4156,2020-04-20 00:00:00
3,4762,727.0,14,47626955@email.com,2019-12-08 00:00:00,1,0,student_9495,2019-12-09 00:00:00
4,865,465.0,25,8655420@email.com,2020-03-16 00:00:00,0,8,student_3685,2020-03-17 00:00:00

In [36]:
d_instructors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52452 entries, 0 to 52451
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            52452 non-null  int64
 1   school_id     52390 non-null  float64
 2   course_id     52452 non-null  int64
 3   email         52452 non-null  object
 4   date_created  52452 non-null  object
 5   admin         52452 non-null  int64
 6   category      52452 non-null  int64
 7   external_id   52452 non-null  object
 8   sync_date     52452 non-null  object
dtypes: float64(1), int64(4), object(4)
memory usage: 3.6+ MB

In [37]:
dtypes = {'id': 'str', 'school_id': 'str', 'course_id': 'str'}

In [38]:
d_instructors2 = pd.read_csv('C:/Users/usuario/%Python/sql-practice/instructors.csv',dtype=dtypes)

In [39]:
# Rename col

# Renombrar columna
d_instructors2.rename(columns = {'id':'instructors_id'}, inplace = True)

In [40]:
# Change column order making it easier to perform queries by course_id

# cambio el orden para que sea más fácil usarla por course_id


d_instructors2 = d_instructors2[['course_id', 'school_id', 'instructors_id', 'email', 'date_created','admin',
                              'category','external_id','sync_date']]

In [41]:
d_instructors2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52452 entries, 0 to 52451
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   course_id       52452 non-null  object
 1   school_id       52390 non-null  object
 2   instructors_id  52452 non-null  object
 3   email           52452 non-null  object
 4   date_created    52452 non-null  object
 5   admin           52452 non-null  int64
 6   category        52452 non-null  int64
 7   external_id     52452 non-null  object
 8   sync_date       52452 non-null  object
dtypes: int64(2), object(7)
memory usage: 3.6+ MB

In [42]:
# convert column to datetime format

# Convertir columna a formato datetime

d_instructors2['date_created_2']= pd.to_datetime(d_instructors2['date_created'])
d_instructors2['sync_date_2']= pd.to_datetime(d_instructors2['sync_date'])
d_instructors2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52452 entries, 0 to 52451
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   course_id       52452 non-null  object
 1   school_id       52390 non-null  object
 2   instructors_id  52452 non-null  object
 3   email           52452 non-null  object
 4   date_created    52452 non-null  object
 5   admin           52452 non-null  int64
 6   category        52452 non-null  int64
 7   external_id     52452 non-null  object
 8   sync_date       52452 non-null  object
 9   date_created_2  52452 non-null  datetime64[ns]
 10  sync_date_2     52452 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(2), object(7)
memory usage: 4.4+ MB

In [44]:
# Load datafile to the database (with replace)

# Cargar el archivo a la base de datos (con replace)

d_instructors2.to_sql('instructors',connection,if_exists='replace')

52452

### Submissions

In [10]:
# Load data file

# Cargar el archivo de datos
d_submissions =  pd.read_csv('C:/Users/usuario/%Python/sql-practice/submissions.csv')

In [11]:
d_submissions.head()

,submission_id,user_id,course_id,assignment_submission_id,school_id,created_automatically,submission_date,deleted,active,sync_date,course_count
0,22901,25781,27,209380,839.0,2,2019-10-24 00:00:00,0,0,2019-10-25 00:00:00,839_27
1,434067,21533,59,18829,79.0,1,2019-10-22 00:00:00,0,0,2019-10-23 00:00:00,79_59
2,330025,18278,1,13280,107.0,0,2019-03-30 00:00:00,0,1,2019-03-31 00:00:00,107_1
3,444610,24854,38,231269,648.0,1,2021-12-03 00:00:00,0,1,2021-12-04 00:00:00,648_38
4,297178,14471,60,37119,51.0,2,2019-11-23 00:00:00,0,1,2019-11-24 00:00:00,51_60

In [12]:
d_submissions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 11 columns):
 #   Column                    Non-Null Count    Dtype
---  ------                    --------------    -----
 0   submission_id             1000000 non-null  int64
 1   user_id                   1000000 non-null  int64
 2   course_id                 1000000 non-null  int64
 3   assignment_submission_id  1000000 non-null  int64
 4   school_id                 998824 non-null   float64
 5   created_automatically     1000000 non-null  int64
 6   submission_date           1000000 non-null  object
 7   deleted                   1000000 non-null  int64
 8   active                    1000000 non-null  int64
 9   sync_date                 1000000 non-null  object
 10  course_count              1000000 non-null  object
dtypes: float64(1), int64(7), object(3)
memory usage: 83.9+ MB

In [13]:
# Submissions looks big (rows and columns)

# Submissions es una archivo grande (ver cantidad de filas y columnas)
d_submissions.shape

(1000000, 11)

In [14]:
# All Id to str (changing the format)

# Todos los Id a str (cambiando el formato)
dtypes = {'submission_id': 'str', 'user_id': 'str', 'course_id': 'str', 'assignment_submission_id': 'str',
         'school_id': 'str'}

In [15]:
d_submissions2 = pd.read_csv('C:/Users/usuario/%Python/sql-practice/submissions.csv',dtype=dtypes)
d_submissions2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 11 columns):
 #   Column                    Non-Null Count    Dtype
---  ------                    --------------    -----
 0   submission_id             1000000 non-null  object
 1   user_id                   1000000 non-null  object
 2   course_id                 1000000 non-null  object
 3   assignment_submission_id  1000000 non-null  object
 4   school_id                 998824 non-null   object
 5   created_automatically     1000000 non-null  int64
 6   submission_date           1000000 non-null  object
 7   deleted                   1000000 non-null  int64
 8   active                    1000000 non-null  int64
 9   sync_date                 1000000 non-null  object
 10  course_count              1000000 non-null  object
dtypes: int64(3), object(8)
memory usage: 83.9+ MB

In [16]:
# convert column to datetime format

# Convertir columna a formato datetime

d_submissions2['submission_date_2']= pd.to_datetime(d_submissions2['submission_date'])
d_submissions2['sync_date_2']= pd.to_datetime(d_submissions2['sync_date'])
d_submissions2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 13 columns):
 #   Column                    Non-Null Count    Dtype
---  ------                    --------------    -----
 0   submission_id             1000000 non-null  object
 1   user_id                   1000000 non-null  object
 2   course_id                 1000000 non-null  object
 3   assignment_submission_id  1000000 non-null  object
 4   school_id                 998824 non-null   object
 5   created_automatically     1000000 non-null  int64
 6   submission_date           1000000 non-null  object
 7   deleted                   1000000 non-null  int64
 8   active                    1000000 non-null  int64
 9   sync_date                 1000000 non-null  object
 10  course_count              1000000 non-null  object
 11  submission_date_2         1000000 non-null  datetime64[ns]
 12  sync_date_2               1000000 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(8)
memory usage: 99.2+ MB

In [17]:
d_submissions2['active'].value_counts()

1    500334
0    499666
Name: active, dtype: int64

In [18]:
d_submissions2['submission_date_2'].dt.date.min()

datetime.date(2019, 1, 1)

In [19]:
d_submissions2['submission_date_2'].dt.date.max()

datetime.date(2022, 11, 1)

In [38]:
# For this example let's use 2021-2022-2023.

# Para este ejemplo usemos solo 2021-2022-2023.
start_date = '2021-12-31'
#end_date = '2019-03-30'

In [39]:
#mask = (d_submissions2['submission_date_2'] > start_date) & (d_submissions2['submission_date_2'] <= end_date)
mask = (d_submissions2['submission_date_2'] > start_date)

In [40]:
d_submissions3 = d_submissions2.loc[mask]

In [41]:
d_submissions3.shape

(217810, 13)

In [42]:
d_submissions3['submission_date_2'].dt.date.min()

datetime.date(2022, 1, 1)

In [43]:
d_submissions3['submission_date_2'].dt.date.max()

datetime.date(2022, 11, 1)

In [64]:
# Load datafile to the database (with replace)

# Cargar el archivo a la base de datos (con replace)

d_submissions3.to_sql('submissions',connection,if_exists='replace')

478382

In [44]:
d_submissions3.shape

(217810, 13)

In [45]:
compression_opts = dict(method='zip',
                        archive_name='out.csv')  
d_submissions3.to_csv('submissions.zip', index=False,
          compression=compression_opts)

In [47]:
d_submissions3.to_csv('submmissions.csv', index=False)

### Courses

In [66]:
d_courses =  pd.read_csv('C:/Users/usuario/%Python/sql-practice/courses.csv')
d_courses.head()

,id,course_name,date_created,school_id,public_course,category,sync_date
0,6900,biology569,2019-11-27 00:00:00,100.0,1,6,2019-11-28 00:00:00
1,6901,biology1049,2020-08-06 00:00:00,261.0,0,8,2020-08-07 00:00:00
2,6902,biology725,2020-03-29 00:00:00,322.0,0,6,2020-03-30 00:00:00
3,6903,biology427,2020-08-06 00:00:00,54.0,0,7,2020-08-07 00:00:00
4,6904,biology1139,2019-03-14 00:00:00,218.0,0,8,2019-03-15 00:00:00

In [67]:
d_courses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55039 entries, 0 to 55038
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             55039 non-null  int64
 1   course_name    55039 non-null  object
 2   date_created   55039 non-null  object
 3   school_id      54977 non-null  float64
 4   public_course  55039 non-null  int64
 5   category       55039 non-null  int64
 6   sync_date      55039 non-null  object
dtypes: float64(1), int64(3), object(3)
memory usage: 2.9+ MB

In [68]:
dtypes = {'id': 'str', 'school_id': 'str'}

In [70]:
d_courses2 = pd.read_csv('C:/Users/usuario/%Python/sql-practice/courses.csv',dtype=dtypes)
d_courses2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55039 entries, 0 to 55038
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             55039 non-null  object
 1   course_name    55039 non-null  object
 2   date_created   55039 non-null  object
 3   school_id      54977 non-null  object
 4   public_course  55039 non-null  int64
 5   category       55039 non-null  int64
 6   sync_date      55039 non-null  object
dtypes: int64(2), object(5)
memory usage: 2.9+ MB

In [71]:
d_courses2['public_course'].value_counts()

0    27872
1    27167
Name: public_course, dtype: int64

In [72]:
d_courses2['category'].value_counts()

6    6340
0    6222
8    6162
5    6149
4    6079
1    6063
2    6038
3    5997
7    5989
Name: category, dtype: int64

In [73]:
d_courses2.category = d_courses2.category.astype(str)

In [74]:
d_courses2.public_course = d_courses2.public_course.astype(str)

In [75]:
d_courses2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55039 entries, 0 to 55038
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             55039 non-null  object
 1   course_name    55039 non-null  object
 2   date_created   55039 non-null  object
 3   school_id      54977 non-null  object
 4   public_course  55039 non-null  object
 5   category       55039 non-null  object
 6   sync_date      55039 non-null  object
dtypes: object(7)
memory usage: 2.9+ MB

In [76]:
d_courses2['date_created_2']= pd.to_datetime(d_courses2['date_created'])
d_courses2['sync_date_2']= pd.to_datetime(d_courses2['sync_date'])
d_courses2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55039 entries, 0 to 55038
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              55039 non-null  object
 1   course_name     55039 non-null  object
 2   date_created    55039 non-null  object
 3   school_id       54977 non-null  object
 4   public_course   55039 non-null  object
 5   category        55039 non-null  object
 6   sync_date       55039 non-null  object
 7   date_created_2  55039 non-null  datetime64[ns]
 8   sync_date_2     55039 non-null  datetime64[ns]
dtypes: datetime64[ns](2), object(7)
memory usage: 3.8+ MB

In [77]:
d_courses2.to_sql('courses',connection,if_exists='replace')

55039

### Users

In [89]:
d_users =  pd.read_csv('C:/Users/usuario/%Python/sql-practice/users.csv')

In [90]:
d_users.head()

,id,email,external_id,date_created,admin,category,sync_date
0,19077,190777503@email.com,student_8644,2019-01-07 00:00:00,0,8,2019-01-08 00:00:00
1,8459,84599050@email.com,student_1230,2020-08-14 00:00:00,1,0,2020-08-15 00:00:00
2,457,4574423@email.com,student_5666,2019-09-19 00:00:00,1,6,2019-09-20 00:00:00
3,77,773297@email.com,student_7844,2019-10-31 00:00:00,0,9,2019-11-01 00:00:00
4,7125,71258995@email.com,student_8925,2019-06-22 00:00:00,0,8,2019-06-23 00:00:00

In [93]:
d_users.to_sql('users',connection,if_exists='replace')

27985